#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_dns.k8s_dns: Refreshing state... [id=113800552115]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113800552129]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113800552125]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113800552120]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113800552128]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113800552117]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113800552138]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113800552119]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113800552118]
random_password.cluster_pass: Refreshing state... [id=none]
null_resource.ssh-key: Refreshing state... [id=4988053478881267451]
data.local_file.ssh-key: Reading...
data.local_file.ssh-key: Read complete after 0s [id=8edc68c81d9799ba433d767bbc2db56878ad5970]
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113601947141]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113800552127]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113800552124]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113800552132]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113800552121]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113800552123]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113800552130]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113800552135]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113800552133]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113800552116]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113800552139]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113800552164]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113800552168]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113800552165]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113800552166]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113800552169]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113800552167]
sakuracloud_dns_record.root_record_ipv6: Refreshing state... [id=dnsrecord-1122255754]
sakuracloud_dns_record.root_record_ipv4: Refreshing state... [id=dnsrecord-1196909408]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113800552174]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113800552177]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113800552176]
sakuracloud_dns_record.wildcard_record: Refreshing state... [id=dnsrecord-860880956]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113800552123" -> (known after apply)
        name                 = "drove-dev-worker-node-1"
      ~ server_id            = "113800552165" -> (known after apply)
      ~ size                 = 20 -> 40 # forces replacement
        tags                 = [
            "dev",
            "drove",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113800552127" -> (known after apply)
        name                 = "drove-dev-worker-node-2"
      ~ server_id            = "113800552167" -> (known after apply)
      ~ size                 = 20 -> 40 # forces replacement
        tags                 = [
            "dev",
            "drove",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113800552121" -> (known after apply)
        name                 = "drove-dev-worker-node-3"
      ~ server_id            = "113800552168" -> (known after apply)
      ~ size                 = 20 -> 40 # forces replacement
        tags                 = [
            "dev",
            "drove",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113800552132" -> (known after apply)
        name                 = "drove-dev-worker-node-4"
      ~ server_id            = "113800552169" -> (known after apply)
      ~ size                 = 20 -> 40 # forces replacement
        tags                 = [
            "dev",
            "drove",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113800552130" -> (known after apply)
        name                 = "drove-dev-worker-node-5"
      ~ server_id            = "113800552164" -> (known after apply)
      ~ size                 = 20 -> 40 # forces replacement
        tags                 = [
            "dev",
            "drove",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113800552124" -> (known after apply)
        name                 = "drove-dev-worker-node-6"
      ~ server_id            = "113800552166" -> (known after apply)
      ~ size                 = 20 -> 40 # forces replacement
        tags                 = [
            "dev",
            "drove",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113800552123",
          - "113800552117",
        ] -> (known after apply)
        id                = "113800552165"
        name              = "drove-dev-worker-node-1"
        tags              = [
            "dev",
            "drove",
        ]
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113800552127",
          - "113800552129",
        ] -> (known after apply)
        id                = "113800552167"
        name              = "drove-dev-worker-node-2"
        tags              = [
            "dev",
            "drove",
        ]
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113800552121",
          - "113800552128",
        ] -> (known after apply)
        id                = "113800552168"
        name              = "drove-dev-worker-node-3"
        tags              = [
            "dev",
            "drove",
        ]
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113800552132",
          - "113800552118",
        ] -> (known after apply)
        id                = "113800552169"
        name              = "drove-dev-worker-node-4"
        tags              = [
            "dev",
            "drove",
        ]
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113800552130",
          - "113800552120",
        ] -> (known after apply)
        id                = "113800552164"
        name              = "drove-dev-worker-node-5"
        tags              = [
            "dev",
            "drove",
        ]
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113800552124",
          - "113800552138",
        ] -> (known after apply)
        id                = "113800552166"
        name              = "drove-dev-worker-node-6"
        tags              = [
            "dev",
            "drove",
        ]
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 6 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>